IdeaRS.Connections
WeldData Class
Compatible with IDEA StatiCa 0.0
 Represents properties of the weld
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.WeldData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class WeldData : ICopyable
The WeldData type exposes the following members.
Constructors
Name | Description
WeldData
 Constructor
Top
Properties
Name | Description
BeginOffset
EndOffset
IntermittentGap
IntermittentLength
Size
 Gets or sets the size of the weld
WeldMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from the connected member
WeldType
 Gets or sets the type of the weld
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace